[
 {
  "msg": "Welcome to our platform! Registration is open. We are looking very forward to see you playing Pwn2Win on May 29.",
  "time": 1590069460
 },
 {
  "msg": "Please submit flags only once. No submission is lost, as you can see at your pull request. They are processed in queue so your score will never be harmed.",
  "time": 1590772940
 },
 {
  "msg": "Queue should get normal in a few minutes, thank you for the patience.",
  "time": 1590780049
 },
 {
  "msg": "Queue fixed! Now your submissions will count instantaneously! :)",
  "time": 1590780940
 },
 {
  "msg": "[web-watchers] We changed the name of the link pointing to the challenge's source code to highlight it since it went unnoticed by some teams.",
  "time": 1590799965
 },
 {
  "msg": "Hey guys, follow us on Twitter @eltctfbr and @pwn2win ;-)",
  "time": 1590806759
 },
 {
  "msg": "[Oldschool Adventures] To help you to test your payloads locally: we are using JSBeeb Emulator and Dynamsoft Barcode Reader (trial version) to check the QRs",
  "time": 1590832971
 },
 {
  "msg": "If you want a more lightweight version of the scoreboard, visit: https://pwn2.win/2020/#/rank or https://ctftime.org/live/961",
  "time": 1590839548
 },
 {
  "msg": "New challenge released: [Matrona v2] :-D",
  "time": 1590843351
 },
 {
  "msg": "We are halfway through the #Pwn2Win CTF 2020! Come on, 24 hours to conquer the Glory! :D",
  "time": 1590856444
 },
 {
  "msg": "If you're stuck in one of unsolved challenges let us know your progress before we release a fair hint. Please pm herrera on irc if you're trying Matrona V2 or Quasi-scriptless and abrasax if you're stuck in Watchers.",
  "time": 1590861389
 },
 {
  "msg": "[Quasi-scriptless] Butcher Corp was so adamant about preventing forms from being submitted that they blocked them in two different ways. What they weren't expecting was that this problem could also be approached from a different side - and even better - without violating these directives.",
  "time": 1590864684
 },
 {
  "msg": "If you are a member of the CL34R team which played last year, please contact gnx at freenode.",
  "time": 1590865975
 },
 {
  "msg": "Watchers is running wappalyzer version 6.0.0 but you should be able to solve our challenge on all recent versions.",
  "time": 1590888484
 },
 {
  "msg": "[Oldschool Adventures] The QR code content should be a usual Linux shell command (not a BBC one).",
  "time": 1590894608
 },
 {
  "msg": "[Dial-up Interception] This challenge is not stego. Please note stego is banned from Pwn2Win since 2017. The task is about demodulating the signal of the dial-up internet connection. If you are not old enough to have used a dial-up and have no idea what this is about, please visit Wikipedia. There are no custom protocols nor guessing involved.",
  "time": 1590895764
 },
 {
  "msg": "12 hours left, gogogod!",
  "time": 1590899881
 }
]